# GIT (CKB) - Распределенная система контроля версий.
# и ведения истории изменений файлов в вашем проекте 

# Репозиторий - хранилище вашего кода и истории его изменений.

# github - это вебсайт для размещения гид-репозиториев и совместной разработки проектов.

# Команды git:
# 1.git init - создает новый репозиторий локальна на ПК.
# 2.git commit - m (как только мы достигаем определнного момента в разработке,то тогда мы сохраняем и комментируем изменения.)

# 3.git add - загружаем все изменения , после загружаем их в локальный репозиторий
#3.1.git add <file name>
#3.2.git add .