
# Дополнительные задания по функциям

"""
1.Напишите функцию которая принимает интервал в виде двух чисел, например 1000 и 3001 и выдает список всех чисел, в заданном интервале, состоящиx из четных цифер - ['2000', '2002', '2004', '2006', '2008', '2020', '2022', '2024', '2026' ... ] 
"""

# пишите код здесь

"""
2. Вы используете приложение для построения маршрутов - каждый раз, когда вы нажимаете кнопку, приложение отправляет вам маршрут для прогулки в виде списка однобуквенных строк 
(например, ['с', 'ю', 'з', 'в'] - север, юг, запад и восток соответственно). 
Вы всегда проходите только один квартал для каждого направления, и тратите ровно одну минуту для пересечения одного городского квартала. Напишите функцию, которая вернет True, если прогулка, которую дает вам приложение, займет у вас ровно десять минут с учетом того, что вы также должны успеть вернутся в исходную точку. В противном случае программа должна вернуть False. 
"""


# пишите код здесь

