
"Check Yourself 4-week"

"""1) Дан список, со строками. Отфильтруйте
этот список, оставив только те строки, длина
которых больше 7 символов.

2) Вам дано три числа(имеется в виду создать
3 переменные с числовыми значениями),
используйте условные операторы и выведите на
экран наибольшее из них."""


# def num_max (a,b,c)
#   if a > b and b >= c :
#     return a
#   elif b > a :
#     return (b)
# print(num_max(1,2,3))
    
"""
3) Дан список с числами. Посчитайте
количество чётных и нечётных чисел в этом
списке.

"""
4) Напишите функцию, которая будет принимать
строку и проверять является ли она
палиндромом. Пробелы и регистр учитывать не
нужно.
(Палиндро́м, пе́ревертень — число,
буквосочетание, слово или текст, одинаково
читающееся в обоих направлениях. Например,
число 101; слова "кок", "топот", "комок" и
т.д.)"""

# a = ['тот','этот','анна','101']
# def pol(a) : 
#     if a [i] == a [-1]
# print (pol(a))
"""
5) Дан список list_ = [-1, 2, 3, 0, 5, -3,7,]. Если число в списке меньше 0, замените
его на False, если больше, то на True"""

# list_ = [-1, 2, 3, 0, 5, -3,7,]
# new_list = [True  for num if num > 0 in list_ else False]
# print (new_list)