# Области видимости и пространства имён. Функции повторение.

"""
1) Есть глобальная переменная, которая обозначает размер самой главной первой матрешки. Напишите функцию, в которой к размеру главной матрешки прибавляется размер второй матрешки, который определен в этой функции. То же самое сделайте и с третьей функцией внутри второй. Верните результат сложения.
"""
# def fun_1():
#     def fun_2():
#         return first_function + 5
#     first_function = matryoshka_size + 10
#     return fun_2()
 
# matryoshka_size = 10
# print(fun_1())

  
"""
2) Есть глобальная переменная, которая содержит пустой список. Вам необходимо написать функции, одна из которых add() - добавляет в этот список имена, которые вводит пользователь. А другая функция remove() - удаляет эти имена из списка по индексу, который вводит пользователь. Вызовите функции в рандомном порядке 10 раз и в конце выведите список.
"""
# писать код здесь


# Повторение темы "Функции". 
"""
3. У Ирины футболки 2 цветов. Ирина одевает красную футболку в чётные числа месяца, а синюю в нечётные.
Напишите программу, которая по введённому числу месяца определяет какую футболку нужно одеть Ирине сегодня.
"""

# from random import choice
 
# def add():
#     global c
#     c.append(input('Введите имя '))
 
# def remove():
#     global c
#     if not len(c): return
#     del c[int(input(f'Удалить имя от 0 до {len(c) - 1} '))]
 
# c = []
# for i in range(10):
#     choice([add, remove])()
# print(c)



"""
4. Пользователь должен ввести 2 целых числа, Вам необходимо проверить делится ли первое число на второе. Вывести результат, а также остаток от деления (если есть).
"""


# писать код здесь



"""
5. Вам даны три числа, используйте условные операторы и выведите на экран наибольшое из них.
"""


# писать код здесь



"""
6. Вам дан список из чисел. Напишите функцию, которая вернёт новый список из квадратов этих чисел.
"""

# писать код здесь



"""
7. Вам дан список из целых чисел. Напишите функцию для вычисления факториала каждого из чисел, результат записать в новый список.
"""


# писать код здесь



